In [1]:
# https://pandas.pydata.org/docs/getting_started/intro_tutorials/index.html
import pandas as pd

In [2]:
# create a simple data frame
df = pd.DataFrame(
    {
        'Name': [
            'Johnny',
            'Rachel',
            'Peter'
        ],
        'Age': [30, 40, 50],
        'Sex': ['male', 'female', 'male']
    }
)

df

     Name  Age     Sex
0  Johnny   30    male
1  Rachel   40  female
2   Peter   50    male

In [3]:
# Each column in DataFrame is a Series
import pandas
print(type(df['Age']))
isinstance(df['Age'], pandas.core.series.Series)

<class 'pandas.core.series.Series'>

True

In [4]:
# create a Series
weights = pd.Series([70, 51, 30], name='Weight')
weights

0    70
1    51
2    30
Name: Weight, dtype: int64

In [5]:
# do something with a DataFrame or Series
df.max()
# df.describe()

Name    Rachel
Age         50
Sex       male
dtype: object

In [6]:
df.dtypes

Name    object
Age      int64
Sex     object
dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

## Conversion

In [8]:
df.to_excel('simple.xlsx', sheet_name="simple", index=False)

In [9]:
df.to_csv('simple.csv')

In [10]:
df2 = pd.read_excel('simple.xlsx')

In [11]:
df2.head()

     Name  Age     Sex
0  Johnny   30    male
1  Rachel   40  female
2   Peter   50    male